# GUID Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..GUID Property
FabricationConfigurationInfo Class See Also
---
The unique identification of the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Guid GUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid GUID {
	Guid get ();
}
```

# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace